# Exploring the Raw Titanic Dataset

## Imports

In [3]:
import pandas as pd
import numpy as np

## Data

In [4]:
df = pd.read_csv('titanic_train_raw.csv')
df_clean = pd.read_csv('titanic_train_clean_raw.csv')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df_clean.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,B96 B98,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,B96 B98,S

### Function to check missing entries

In [7]:
def total_missing(df,column_name):
    missing = df[column_name].isnull().sum()
    return missing

In [8]:
total_missing(df,'Age')

177

### Function to replace missing data with mean, median or mode

In [9]:
def calc_mean_mode(df, column_name):
    
    if not {column_name}.issubset(df.columns):
        raise ValueError("Column does not exist")
    
    if df[column_name].dtype == 'object':
        output = list(df[column_name].mode())
    else:
        output = round(df[column_name].mean(), 2)
    return output

In [10]:
calc_mean_mode(df, 'Embarked')

['S']

### Function to predict survival chance by conditional probability

In [11]:
def survival_likelihood(df,column_name, boolean_operator, value):
        if boolean_operator == '==':
            probability = df_clean['Survived'][df_clean[column_name] == float(value)].value_counts(normalize = True)[1]
        elif boolean_operator == '<':
            probability = df_clean['Survived'][df_clean[column_name] < float(value)].value_counts(normalize = True)[1]
        elif boolean_operator == '>':
            probability = df_clean['Survived'][df_clean[column_name] > float(value)].value_counts(normalize = True)[1]
        likelihood  = np.around(probability, 2)
        return likelihood

In [12]:
survival_likelihood(df,"Pclass","==","3")

0.24